Plan:
```
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.inventory_2_8.aws_iam_role.inventory will be destroyed
  - resource "aws_iam_role" "inventory" {
      - arn                   = "arn:aws:iam::587807691409:role/inventory-2-8-sandbox-s3-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = "InventoryS3AssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2020-05-08T05:00:25Z" -> null
      - force_detach_policies = false -> null
      - id                    = "inventory-2-8-sandbox-s3-role" -> null
      - max_session_duration  = 3600 -> null
      - name                  = "inventory-2-8-sandbox-s3-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - unique_id             = "AROAYRXARSKI4F64VOX46" -> null
    }

  # module.inventory_next.aws_iam_instance_profile.inventory will be created
  + resource "aws_iam_instance_profile" "inventory" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "inventory-next-sandbox-inventory-profile"
      + path        = "/"
      + role        = "inventory-next-sandbox-s3-role"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.inventory_next.aws_iam_role.inventory will be created
  + resource "aws_iam_role" "inventory" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "InventoryS3AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "inventory-next-sandbox-s3-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.inventory_next.aws_iam_role_policy.inventory will be created
  + resource "aws_iam_role_policy" "inventory" {
      + id     = (known after apply)
      + name   = "inventory_s3_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::datagov-appdata-inventory-next-sandbox",
                          + "arn:aws:s3:::datagov-appdata-inventory-next-sandbox/*",
                        ]
                    },
                  + {
                      + Action   = "S3:ListAllMyBuckets"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.inventory_next.aws_security_group.inventory will be created
  + resource "aws_security_group" "inventory" {
      + arn                    = (known after apply)
      + description            = "Security group for inventory-next web instance in sandbox"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "inventory-next-sandbox"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env"  = "sandbox"
          + "name" = "inventory-next"
        }
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.inventory_next.module.redis.aws_elasticache_replication_group.redis[0] will be created
  + resource "aws_elasticache_replication_group" "redis" {
      + apply_immediately              = (known after apply)
      + at_rest_encryption_enabled     = false
      + auth_token                     = (sensitive value)
      + auto_minor_version_upgrade     = true
      + automatic_failover_enabled     = false
      + configuration_endpoint_address = (known after apply)
      + engine                         = "redis"
      + engine_version                 = "5.0.6"
      + id                             = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + node_type                      = "cache.t3.small"
      + number_cache_clusters          = 1
      + parameter_group_name           = "default.redis5.0"
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + replication_group_description  = "Redis replication group for sandbox-inventory-next"
      + replication_group_id           = "rep-sandbox-inventory-next"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "inventory-next-sandbox"
      + tags                           = {
          + "env"  = "sandbox"
          + "name" = "inventory-next"
        }
      + transit_encryption_enabled     = true

      + cluster_mode {
          + num_node_groups         = (known after apply)
          + replicas_per_node_group = (known after apply)
        }
    }

  # module.inventory_next.module.redis.aws_elasticache_subnet_group.redis[0] will be created
  + resource "aws_elasticache_subnet_group" "redis" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "inventory-next-sandbox"
      + subnet_ids  = [
          + "subnet-0bbe8705ad1ce9a08",
          + "subnet-0f531007fa515a1fb",
        ]
    }

  # module.inventory_next.module.redis.aws_security_group.redis[0] will be created
  + resource "aws_security_group" "redis" {
      + arn                    = (known after apply)
      + description            = "Security group for Redis"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "inventory-next-redis-sandbox"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env"  = "sandbox"
          + "name" = "inventory-next"
        }
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.inventory_next.module.s3.aws_s3_bucket.default will be created
  + resource "aws_s3_bucket" "default" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "datagov-appdata-inventory-next-sandbox"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.inventory_next.module.web.aws_acm_certificate.lb will be created
  + resource "aws_acm_certificate" "lb" {
      + arn                       = (known after apply)
      + domain_name               = "inventory-next.sandbox.datagov.us"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "env" = "sandbox"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.inventory_next.module.web.aws_acm_certificate_validation.lb will be created
  + resource "aws_acm_certificate_validation" "lb" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.inventory_next.module.web.aws_instance.web[0] will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-03a2cbdcd9e7d1955"
      + arn                          = (known after apply)
      + associate_public_ip_address  = false
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + iam_instance_profile         = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.small"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "datagov-sandbox"
      + network_interface_id         = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-0bbe8705ad1ce9a08"
      + tags                         = {
          + "Name"  = "inventory-next-web1tf"
          + "env"   = "sandbox"
          + "group" = "inventory_web,inventory_web_next,v2"
        }
      + tenancy                      = (known after apply)
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.inventory_next.module.web.aws_lb_target_group_attachment.lb[0] will be created
  + resource "aws_lb_target_group_attachment" "lb" {
      + id               = (known after apply)
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.inventory_next.module.web.aws_route53_record.lb will be created
  + resource "aws_route53_record" "lb" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "inventory-next"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z05804831W9PRQ2GEV3V1"
    }

  # module.inventory_next.module.web.aws_route53_record.lb_cert_validation will be created
  + resource "aws_route53_record" "lb_cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05804831W9PRQ2GEV3V1"
    }

  # module.inventory_next.module.web.aws_route53_record.web[0] will be created
  + resource "aws_route53_record" "web" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "inventory-next-web1tf"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z1006361VZ0GA3BRODCA"
    }

  # module.inventory_next.module.web.aws_security_group.lb will be created
  + resource "aws_security_group" "lb" {
      + arn                    = (known after apply)
      + description            = "Load balancer security group for inventory-next-sandbox"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "inventory-next-sandbox-lb-sg-tf"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.inventory_next.module.web.aws_security_group.web will be created
  + resource "aws_security_group" "web" {
      + arn                    = (known after apply)
      + description            = "Web security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "inventory-next-sandbox-web-sg-tf"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.inventory_next.module.db.module.database.aws_db_instance.default will be created
  + resource "aws_db_instance" "default" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "datagov-sandbox"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "9.6.1"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + kms_key_id                            = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = "inventory_db_next"
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.postgres9.6"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + status                                = (known after apply)
      + storage_type                          = "gp2"
      + timezone                              = (known after apply)
      + username                              = "inventory_master"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.inventory_next.module.db.module.database.aws_security_group.db_access will be created
  + resource "aws_security_group" "db_access" {
      + arn                    = (known after apply)
      + description            = "Allowed access to database"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "inventory_db_next-sandbox-db-access-tf"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.inventory_next.module.db.module.database.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Database security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "inventory_db_next-sandbox-db-tf"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.inventory_next.module.web.module.lb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "inventory-next-sandbox-tf"
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-03ad95501c749e10a",
          + "subnet-0851c49a6d7007b74",
        ]
      + tags                       = {
          + "Environment" = "sandbox"
          + "Name"        = "inventory-next-sandbox-tf"
          + "Terraform"   = "true"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id = (known after apply)
          + subnet_id     = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.inventory_next.module.web.module.lb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.inventory_next.module.web.module.lb.aws_lb_listener.frontend_https[0] will be created
  + resource "aws_lb_listener" "frontend_https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = (known after apply)
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = (known after apply)
        }
      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = (known after apply)
        }
    }

  # module.inventory_next.module.web.module.lb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "inventory-next-sandbox"
      + port                               = 80
      + protocol                           = "HTTP"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "sandbox"
          + "Name"        = "inventory-next-sandbox"
          + "Terraform"   = "true"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0e4d22d8b2666bf6f"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

Plan: 24 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------
```